export const trainers = [
  {
    id: 1,
    link: "monya",
    name: "Виданович Момчило",
    title: "Основатель фитнес-клуба VOLIMFIT",
    education: "Высшее физкультурное (БАГСУ), Школа олимпийского резерва при ВВА",
    experience: "10 лет",
    specializations: [
      "Коррекция фигуры, жиросжигание и набор мышечной массы",
      "Функциональный и силовой тренинг",
      "Подготовка к ГТО и соревнованиям",
      "Реабилитация после травм",
      "ОФП для детей",
    ],
    achievements: [
      "ТОП-5 в категории Men’s Physique на чемпионате МО по бодибилдингу (2017)",
      "Чемпион России по регби (2009)",
    ],
    imageSrc: "/trainer_1.jpg",
    roles: ["Персональный тренер", "Тренер групповых программ"],
    category:"Элит тренер"
  },
  {
    id: 2,
    link: "kashirskyi",
    name: "Каширский Артём",
    title: "Персональный тренер / Тренер групповых детских программ",
    education: "Училище олимпийского резерва",
    experience: "6 лет",
    specializations: [
      "Коррекция фигуры, снижение веса и набор мышечной массы",
      "Составление плана тренировок",
      "Силовой тренинг, функциональные тренировки, развитие выносливости",
      "Реабилитация после травм",
      "Нутрициология, составление рациона питания под цели клиента",
      "Тэг-регби",
      "ОФП для детей",
      "Стретчинг",
    ],
    achievements: [
      "Мастер спорта по регби",
      "3-х кратный Чемпион Европы по регби",
      "Чемпион России по регби",
    ],
    imageSrc: "/trainer_2.jpg",
    roles: ["Персональный тренер", "Тренер групповых программ"],
      category:"Мастер-тренер"
  },
  {
    id: 3,
    link: "morozova",
    name: "Морозова Ольга",
    title: "Персональный тренер / Тренер групповых программ",
    education: "Высшее физкультурное",
    experience: "20 лет",
    specializations: [
      "Коррекция нарушений осанки (работа со сколиозами у детей и взрослых)",
      "Коррекция веса и фигуры",
      "TRX",
      "Pilates",
      "Мастер тайского массажа (с 2010)",
    ],
    achievements: [
      "2 взрослый разряд по спортивной гимнастике",
      "Выпускница института Сеченова по специализации «Антиэйджинг» (2023)",
      "Сертифицированный тренер по бодибилдингу и фитнесу FPA (2004)",
    ],
    imageSrc: "/trainer_3.jpg",
    roles: ["Персональный тренер", "Тренер групповых программ",],
       category:"Мастер-тренер"
  },
  {
    id: 4,
    link: "kostenko",
    name: "Костенко Дарья",
    title: "Персональный тренер / Тренер групповых программ",
    education: "Высшее педагогическое",
    experience: "12 лет",
    specializations: [
      "Тренировки во время беременности",
      "Восстановление после беременности и родов",
      "Intensive training",
      "BodyStrong",
      "Хореография",
      "Стретчинг",
      "ОФП для детей",
    ],
    achievements: [
      "Призер Всероссийских соревнований по фитнес-аэробике",
      "Участница фитнес конвенций",
      "Сертифицированный тренер BODYPUMP от Les Mills (2018)",
    ],
    imageSrc: "/trainer_4.jpg",
    roles: ["Персональный тренер", "Тренер групповых программ", ],
       category:"Тренер"
  },
  {
    id: 5,
    link: "soloviev",
    name: "Соловьев Геннадий",
    title: "Персональный тренер / Тренер групповых программ",
    education: "Академия фитнеса при «Планета Фитнес» (2003)",
    experience: "21 год",
    specializations: [
      "Силовые и функциональные тренировки",
      "Коррекция фигуры при помощи фитнес-методики по бодибилдингу",
      "Индивидуальная разработка персонального комплекса упражнений для функционального тренинга",
      "Коррекция нарушений осанки",
      "Восстановительный фитнес (посттравматическое восстановление: спина, плечи, колени) ",

    ],
    achievements: [
      "Семинары от DePuySynthes «Виды реабилитации после спортивной травмы» (2014), клиника Ю. Глазкова",
    ],
    imageSrc: "/trainer_5.jpg",
    roles: ["Персональный тренер"],
        category:"Мастер-тренер"
  },
  {
    id: 6,
    link: "khizhnyakov",
    name: "Хижняков Владислав",
    title: "Персональный тренер / Тренер групповых программ",
    education: "Спортивная школа олимпийского резерва (МГФСО)",
    experience: "3 года",
    specializations: [
      "Бокс: групповые и индивидуальные занятия по боксу",
    ],
    achievements: [
      "КМС по кикбоксингу",
      "2 место на чемпионате России по кикбоксингу (2024)",
      "1 место на кубке Москвы по боксу (2023)",
    ],
    imageSrc: "/trainer_6.jpg",
    roles: ["Персональный тренер", "Тренер групповых программ", ],
       category:"Тренер"
  },
  {
    id: 7,
    link: "shalyapina",
    name: "Шаляпина Ксения",
    title: "Персональный тренер / Тренер групповых программ",
    education: "Училище Олимпийского резерва Москомспорта",
    experience: "3 года",
    specializations: [
      "Постановка техники выполнения упражнений",
      "Силовые тренировки, направленные на жиросжигание/набор мышечной массы",
      "Функциональный тренинг и упражнения на выносливость",
      "Коррекция фигуры, гармонизация пропорций тела",
      "BodyPump, BodyFight",
      "Подготовка к ГТО",
    ],
    achievements: [
      "КМС по Карате Киокушинкай",
      "Победитель городских и областных соревнований по спарринговой технике Кумитэ и Кихон Ката в Карате Киокушинкай",
    ],
    imageSrc: "/trainer_7.jpg",
    roles: ["Персональный тренер", "Тренер групповых программ"],
       category:"Тренер"
  },
  {
    id: 8,
    link: "canskih",
    name: "Цанских Яна",
    title: "Персональный тренер",
    education: "Институт РИРО по направлению Физическая культура",
    experience: "5 лет",
    specializations: [
      "Рекомпозиция тела",
      "Силовой и функциональный тренинг",
      "Стретчинг",
      "Рекомендации по питанию, индивидуальный расчёт КБЖУ",
      "Оценка опорно-двигательного аппарата",
      "Коррекция осанки и укрепление спины",
    ],
    achievements: [
      "Квалификация судьи 3 категории по функциональному многоборью",
      "Колледж Б. Вейдера «Стретчинг в работе персонального тренера» (2024)",
      "Сертификат «Стретчинг» Weider College of Fitness & Bodybuilding (2024)",
      "Сертификат «Основы методик ЛФК и реабилитации при сколиозе» BodyCoach (2024)",
      "Сертификат «Основы биомеханики и силовых упражнений» BodyCoach (2024)",
      "Сертификат «Оценка ОДА для фитнес тренера» AnatomyStudy (2024)",
      "Сертификат УПДН «Я-нутрициолог» (2023)",
      "Сертификат «Global fitness trainers» (2023)",
      "Курс «Анатомия» FPA (2023)",
      "Сертификат «Особенности женских тренировок» Premiun Fitness (2022)",
      "Сертификат «Functional body workout» (2020)"
    ],
    imageSrc: "/trainer_8.jpg",
    roles: ["Персональный тренер"],
       category:"Тренер"
  }
];
export const findTrainerByLink=(link:string)=> {
  return trainers.find(trainer => trainer.link === link) || {
    id: 10000,
    link: "не найден",
    name: "не найден",
    title: "не найден",
    education: "не найден",
    experience: "не найден",
    specializations: [
 
    ],
    achievements: [
    
    ],
    imageSrc: "",
    roles: [],
       category:""
  }
}